In [1]:
import sqlite3

01) Write a sql query to get books that has rate >=3 and has 'Mr' in its name.

In [41]:
con = sqlite3.connect('database.db')
sql = 'select * from books where rate >= 3 and name like "%Mr%"'
row = con.execute(sql).fetchall()
con.close()

02) Write a sql query to get books that has rate >=3 or price > 20.

In [42]:
con = sqlite3.connect('database.db')
sql = 'select * from books where rate >= 3 and price > 20'
row = con.execute(sql).fetchall()
con.close()

03) Write a sql query to get books that has rate not 3.

In [43]:
con = sqlite3.connect('database.db')
sql = 'select * from books where rate <> 3'
row = con.execute(sql).fetchall()
con.close()

04) Write a sql query to get books that has price between 10 and 40 and has rate 3 or 4 or 1.

In [44]:
con = sqlite3.connect('database.db')
sql = 'select * from books where (price BETWEEN 10 and 40) and (rate in (1,3,4))'
row = con.execute(sql).fetchall()
con.close()

05) Write a sql query to get the top 5 most expensive books (order books desc with price column and then limit the result to the first 5).

In [45]:
con = sqlite3.connect('database.db')
sql = 'select price from books ORDER by price DESC LIMIT 5'
row = con.execute(sql).fetchall()
con.close()

06) Write a sql query to get the 3rd 10 books in the books table order first by rate desc and then by price asc.

In [46]:
con = sqlite3.connect('database.db')
sql = 'select * from books ORDER by price ASC, rate DESC'
row = con.execute(sql).fetchall()
con.close()

07) Write a sql query to add a new category in categories table and add 5 books to this category in books table with title, rate and price.

In [33]:
# add new category 
con = sqlite3.connect('database.db')
sql = 'insert into categories (catName) values ("child")'
con.execute(sql)
con.commit()
con.close()

# insert 5 new books in this new category
Mylist = [
    ['lion Story',30.2,2,'child'],
    ['cat Story',40.2,5,'child'],
    ['dog Story',50.2,3,'child'],
    ['monkey Story',55.1,2,'child'],
    ['donkey Story',36.1,1,'child'],
]

con = sqlite3.connect('database.db')
for book in Mylist:
    sql = "insert into Books (name,price,rate,catName) VALUES (?,?,?,?)"
    con.execute(sql,book)

con.commit()
con.close()

08) Write a sql query to update book's rate to 3 that thier price < 20£.

In [ ]:
con = sqlite3.connect('database.db')
sql = 'UPDATE Books set rate = 3 where price < 20'
row = con.execute(sql)
con.commit()
con.close()

09) Write a sql query to delete all books that have price > 50£ and has rate <= 2.

In [ ]:
con = sqlite3.connect('database.db')
sql = 'DELETE from books where price > 50 and rate <=2'
row = con.execute(sql)
con.close()
row

10) Write a sql query to count the number of books that have 'Secret' in thier names and price between 10£ and 25£.

In [48]:
con = sqlite3.connect('database.db')
sql = 'select count(name) from books where name like "%Secret%" and price BETWEEN 10 and 20'
row = con.execute(sql).fetchall()
con.close()
row

[(2,)]

11) Write a sql query to get the minimum & maximum price for all the books that have rate 5.

In [51]:
con = sqlite3.connect('database.db')
sql = 'select min(price) as minPrice, max(price) as maxPrice, catName from books where rate = 5 GROUP by catName'
row = con.execute(sql).fetchall()
con.close()

12) Write a sql query to calculate the avg price for all the books that have rate 5.

In [53]:
con = sqlite3.connect('database.db')
sql = 'select AVG(price) from Books where rate = 5'
row = con.execute(sql).fetchall()
con.close()
row

[(41.044516129032274,)]

13) Write a sql query to sum all book's price that have rate 2 and price between 10 and 40

In [54]:
con = sqlite3.connect('database.db')
sql = 'select sum(price) from books where rate = 2 and (price BETWEEN 10 and 40)'
row = con.execute(sql).fetchall()
con.close()
row

[(2802.949999999999,)]

14) Write a sql query to join both books & categories table into one new table containing book_name & category_name & book_rate and book_price.

In [55]:
con = sqlite3.connect('database.db')
sql = 'SELECT Books.name , Categories.catName , books.price, books.rate from books INNER join Categories on Categories.catName = Books.catName'
row = con.execute(sql).fetchall()
con.close()

15) Write a sql query to calculate how many books each rate has and have price between 20£ and 30£.

16) Write a sql query to calculate how many books each category has having count > 10.

In [58]:
con = sqlite3.connect('database.db')
sql = 'select count(catName) as number from books  GROUP by catName HAVING count(catName)>10'
row = con.execute(sql).fetchall()
con.close()

17) Write a sql query to get all books with category_name='Music' using subquery.

In [ ]:
con = sqlite3.connect('database.db')
sql = 'select * from books where catName = (SELECT catName from Categories where catName= "Music")'
row = con.execute(sql).fetchall()
con.close()